OpenFOAM-dev/tutorials/incompressibleFluid/waveSubSurface/0/alpha.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform 1;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    "(top|inlet|outlet)"
    {
        type            waveAlpha;
        libs            ("libwaves.so");
    }

    "(front|back)"
    {
        type            symmetryPlane;
    }
}


// ************************************************************************* //
